config/DataProcessors/ОбработкаЛистаПроверкиДАиК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>ОбработкаЛистаПроверкиДАиК</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВыбДокПроверки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РезультатыПроверкиМагазинаДАиК</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТабДок</Name>
					<Type>
						<v8:Type>mxl:SpreadsheetDocument</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Города</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПроверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Управляющий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

config/Documents/РезультатыПроверкиМагазинаДАиК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>РезультатыПроверкиМагазинаДАиК</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Управляющий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НацДиректор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегионДиректор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Города</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КолвоБаллов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентСоответствия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Результаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Критерий</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КритерииПроверкиМагазиновДАиК</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кво</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомментарииПроверяющего</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокУстранения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗадачаУправляющему</Name>
							<Type>
								<v8:Type>cfg:TaskRef.ЗадачаИсполнителя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомментарийИсполнителя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтметкаОбИсполнении</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыВыполнения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

config/Catalogs/Подразделения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>Подразделения</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодПодразделенияУТ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Управляющий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Закрыт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

config/Catalogs/КритерииПроверкиМагазиновДАиК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>КритерииПроверкиМагазиновДАиК</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПолнНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>350</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПоПорядку</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

config/DataProcessors/ОбработкаЛистаПроверкиДАиК/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Перем МеняемоеЗначение;

&НаКлиенте
Перем Закрывать;


&НаСервере
Процедура ПроверкаПравРедактирования()
	 ТабДок = РеквизитФормыВЗначение("Объект").ТабДок;
	 ВыбДокумент = РеквизитФормыВЗначение("Объект").ВыбДокПроверки;
	 РедактированиеДокумента = Ложь;
	 Если ТекущаяДата()-ВыбДокумент.Дата < Константы.КолвоЧасовРедактированияДокумента.Получить()*3600 Тогда
		 РедактированиеДокумента = Истина;
	 КонецЕсли;
	 Если (НЕ РедактированиеДокумента) И (ВыбДокумент.Автор = ПользователиКлиентСервер.ТекущийПользователь()) Тогда
		 ТабДок.Область("R1C1:R"+ Строка(ТабДок.ВысотаТаблицы) + "C5").Защита = Истина;
	 КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура НачальноеЗаполнениеТабДок()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	ОбработкаОбъект.ДатаПроверки = ТекущаяДата();
	ОбработкаОбъект.Город = Справочники.Города.ПустаяСсылка();
	ОбработкаОбъект.Подразделение = Справочники.Подразделения.ПустаяСсылка();
	ОбработкаОбъект.Управляющий = Справочники.Сотрудники.ПустаяСсылка();
	ОбработкаОбъект.РД = Справочники.Сотрудники.ПустаяСсылка();
	ОбработкаОбъект.НД = Справочники.Сотрудники.ПустаяСсылка();
	ТабДок = ОбработкаОбъект.ТабДок;
	ТабДок.Очистить();
	
	Макет1 = РеквизитФормыВЗначение("Объект").ПолучитьМакет("Макет1");
	
	Обл = Макет1.ПолучитьОбласть("Шапка");
	
	ТабДок.Вывести(Обл);

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВложенныйЗапрос.Ссылка,
	               |	ВложенныйЗапрос.Родитель,
	               |	ВложенныйЗапрос.ЭтоГруппа,
	               |	ВложенныйЗапрос.ПолнНаименование,
	               |	ВЫБОР
	               |		КОГДА ВложенныйЗапрос.НомерПоПорядку > 1000
	               |			ТОГДА ВложенныйЗапрос.НомерПоПорядку
	               |		ИНАЧЕ ВложенныйЗапрос.РодительРодительНомерПоПорядку * 100000 + ВложенныйЗапрос.РодительНомерПоПорядку * 1000 + ВложенныйЗапрос.НомерПоПорядку
	               |	КОНЕЦ КАК ОбщийНомерПоПорядку,
	               |	ВложенныйЗапрос.НомерПоПорядку,
	               |	ВложенныйЗапрос.РодительНомерПоПорядку,
	               |	ВложенныйЗапрос.РодительРодительНомерПоПорядку
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		КритерииПроверкиМагазинов.Ссылка КАК Ссылка,
	               |		КритерииПроверкиМагазинов.Родитель КАК Родитель,
	               |		КритерииПроверкиМагазинов.ЭтоГруппа КАК ЭтоГруппа,
	               |		КритерииПроверкиМагазинов.ПолнНаименование КАК ПолнНаименование,
	               |		ВЫБОР
	               |			КОГДА НЕ КритерииПроверкиМагазинов.ЭтоГруппа
	               |				ТОГДА КритерииПроверкиМагазинов.НомерПоПорядку
	               |			ИНАЧЕ ВЫБОР
	               |					КОГДА КритерииПроверкиМагазинов.Родитель.Ссылка ЕСТЬ NULL 
	               |						ТОГДА 100000 * КритерииПроверкиМагазинов.НомерПоПорядку
	               |					ИНАЧЕ 100000 * КритерииПроверкиМагазинов.Родитель.НомерПоПорядку + 1000 * КритерииПроверкиМагазинов.НомерПоПорядку
	               |				КОНЕЦ
	               |		КОНЕЦ КАК НомерПоПорядку,
	               |		ВЫБОР
	               |			КОГДА КритерииПроверкиМагазинов.Родитель.Ссылка ЕСТЬ NULL 
	               |				ТОГДА 0
	               |			ИНАЧЕ КритерииПроверкиМагазинов.Родитель.НомерПоПорядку
	               |		КОНЕЦ КАК РодительНомерПоПорядку,
	               |		ВЫБОР
	               |			КОГДА КритерииПроверкиМагазинов.Родитель.Родитель.Ссылка ЕСТЬ NULL 
	               |				ТОГДА 0
	               |			ИНАЧЕ КритерииПроверкиМагазинов.Родитель.Родитель.НомерПоПорядку
	               |		КОНЕЦ КАК РодительРодительНомерПоПорядку
	               |	ИЗ
	               |		Справочник.КритерииПроверкиМагазиновДАиК КАК КритерииПроверкиМагазинов
	               |	ГДЕ
	               |		НЕ КритерииПроверкиМагазинов.ПометкаУдаления) КАК ВложенныйЗапрос
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ОбщийНомерПоПорядку";
				   
	тз = Запрос.Выполнить().Выгрузить();
	
	Нпп = 0;
	Для Каждого стр из тз цикл
		Если стр.ЭтоГруппа тогда
			Если ЗначениеЗаполнено(стр.Родитель) тогда  // подгруппа
				Обл = Макет1.ПолучитьОбласть("Группа");
				Обл.Параметры.СтрГруппа = стр.ПолнНаименование;
				Обл.Параметры.Родитель = стр.Родитель;
				Обл.Параметры.БалГруппа = 0;
				ТабДок.Вывести(Обл);

			иначе  // раздел
				Обл = Макет1.ПолучитьОбласть("Раздел");
				Обл.Параметры.СтрРаздел = стр.ПолнНаименование;
				Обл.Параметры.Родитель = "Сам";
				Обл.Параметры.БалРаздел = 0;
				ТабДок.Вывести(Обл);

			КонецЕсли;
			
		иначе // строка
			
			Нпп = Нпп + 1;

			Обл = Макет1.ПолучитьОбласть("Строка");
			Обл.Параметры.Нпп = Нпп;
			//Обл.Параметры.СтрБал = 1;
			Обл.Параметры.СтрНаим = стр.ПолнНаименование;
			Обл.Параметры.Родитель = стр.Родитель;
		    Обл.Параметры.ТекКритерий = стр.Ссылка;
			Обл.Параметры.Исп = Ложь;
			ТабДок.Вывести(Обл);
		КонецЕсли;

	КонецЦикла;
	ОблПусто = Макет1.ПолучитьОбласть("Пусто");
	ТабДок.Вывести(ОблПусто);
	ЗначениеВРеквизитФормы(ОбработкаОбъект,"Объект");
	КолвоКритериев = 0;
	ТабДок.ФиксацияСверху = 8;
КонецПроцедуры

&НаСервере
Процедура ПроверитьХранилище()
	Если ХранилищеНастроекДанныхФорм.Загрузить("Даик","ТЗзаполнения") <> Неопределено 
		ИЛИ ХранилищеНастроекДанныхФорм.Загрузить("Даик","Город") <> Неопределено
		ИЛИ ХранилищеНастроекДанныхФорм.Загрузить("Даик","Управляющий") <> Неопределено
		ИЛИ ХранилищеНастроекДанныхФорм.Загрузить("Даик","Подразделение") <> Неопределено
		ИЛИ ХранилищеНастроекДанныхФорм.Загрузить("Даик","РД") <> Неопределено
		ИЛИ ХранилищеНастроекДанныхФорм.Загрузить("Даик","НД") <> Неопределено ТОГДА
			ЕстьДанныеВХранилище = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПоместитьВХранилище(НомСтроки)
	Если НЕ ЗначениеЗаполнено(Объект.ВыбДокПроверки) Тогда
		ТЗ = ХранилищеНастроекДанныхФорм.Загрузить("Даик","ТЗзаполнения");
		Если ТипЗнч(ТЗ) <> Тип("ТаблицаЗначений") Тогда
			ТЗ = Новый ТаблицаЗначений;
			ТЗ.Колонки.Добавить("НомерСтроки",Новый ОписаниеТипов("Число"));
			ТЗ.Колонки.Добавить("Бал",Новый ОписаниеТипов("Число"));
			ТЗ.Колонки.Добавить("Комментарий",Новый ОписаниеТипов("Строка"));
			ТЗ.Колонки.Добавить("Срок",Новый ОписаниеТипов("Дата"));
		КонецЕсли;
		СтрокаТаблицы = ТЗ.Найти(НомСтроки,"НомерСтроки");
		Если СтрокаТаблицы = Неопределено Тогда
			СтрокаТаблицы = ТЗ.Добавить();
			СтрокаТаблицы.НомерСтроки = НомСтроки;
		КонецЕсли;
		СтрокаТаблицы.Бал = Число(Булево(Объект.ТабДок.Область("R"+НомСтроки+"C3").Значение));
		СтрокаТаблицы.Комментарий=Объект.ТабДок.Область("R"+НомСтроки+"C4").Значение;
		СтрокаТаблицы.Срок = Объект.ТабДок.Область("R"+НомСтроки+"C5").Значение;
		ТЗ.Сортировать("НомерСтроки");
		ХранилищеНастроекДанныхФорм.Сохранить("Даик","ТЗзаполнения",ТЗ);
	КонецЕсли;
КонецПроцедуры

&НаСервере 
Процедура ОчиститьХранилище()
	ХранилищеНастроекДанныхФорм.Удалить("Даик","ТЗзаполнения",ПользователиКлиентСервер.ТекущийПользователь());
	ХранилищеНастроекДанныхФорм.Удалить("Даик","Город",ПользователиКлиентСервер.ТекущийПользователь());
	ХранилищеНастроекДанныхФорм.Удалить("Даик","Управляющий",ПользователиКлиентСервер.ТекущийПользователь());
	ХранилищеНастроекДанныхФорм.Удалить("Даик","Подразделение",ПользователиКлиентСервер.ТекущийПользователь());
	ХранилищеНастроекДанныхФорм.Удалить("Даик","РД",ПользователиКлиентСервер.ТекущийПользователь());
	ХранилищеНастроекДанныхФорм.Удалить("Даик","НД",ПользователиКлиентСервер.ТекущийПользователь());
КонецПроцедуры

&НаСервере
Процедура ВосстановитьИзХранилища()
	ПолеГород = ХранилищеНастроекДанныхФорм.Загрузить("Даик","Город");
	Если ПолеГород <> Неопределено Тогда
		Объект.Город = ПолеГород;
	КонецЕсли;
	
	ПолеУправляющий = ХранилищеНастроекДанныхФорм.Загрузить("Даик","Управляющий");
	Если ПолеУправляющий <> Неопределено Тогда
		Объект.Управляющий = ПолеУправляющий;
	КонецЕсли;
	
	ПолеПодразделение = ХранилищеНастроекДанныхФорм.Загрузить("Даик","Подразделение");
	Если ПолеПодразделение <> Неопределено Тогда
		Объект.Подразделение = ПолеПодразделение;
	КонецЕсли;
	
	ПолеРД = ХранилищеНастроекДанныхФорм.Загрузить("Даик","РД");
	Если ПолеРД <> Неопределено Тогда
		Объект.РД = ПолеРД;
	КонецЕсли;
	
	ПолеНД = ХранилищеНастроекДанныхФорм.Загрузить("Даик","НД");
	Если ПолеНД <> Неопределено Тогда
		Объект.НД = ПолеНД;
	КонецЕсли;
	
	ТЗзаполнения = ХранилищеНастроекДанныхФорм.Загрузить("Даик","ТЗзаполнения");
	Если ТЗзаполнения <> Неопределено Тогда
		Для Каждого СтрокаТаблицы из ТЗзаполнения Цикл
			Объект.ТабДок.Область("R"+СтрокаТаблицы.НомерСтроки + "C3").Значение = СтрокаТаблицы.Бал;
			Объект.ТабДок.Область("R"+СтрокаТаблицы.НомерСтроки + "C3").Формат = "ЧН=0"; 
			Объект.ТабДок.Область("R"+СтрокаТаблицы.НомерСтроки + "C4").Значение = СтрокаТаблицы.Комментарий;
			Объект.ТабДок.Область("R"+СтрокаТаблицы.НомерСтроки + "C5").Значение = СтрокаТаблицы.Срок;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчетСуммРазделов()
	ОбщСумма = 0;	
	Для НомСтр = 9 по Объект.ТабДок.ВысотаТаблицы - 1 цикл
		//Предварительное обнуление разделов и групп
		Если Объект.ТабДок.Область("R" + Строка(НомСтр) + "C1").Текст = "" Тогда
			 Объект.ТабДок.Область("R" + Строка(НомСтр) + "C3").Значение = 0;
		КонецЕсли;
		Поиск = Объект.ТабДок.Область("R" + Строка(НомСтр) + "C1").Расшифровка;
		Родитель = Объект.ТабДок.НайтиТекст(Строка(Поиск),,,,Истина);
		Если Родитель <>Неопределено Тогда
			Объект.ТабДок.Область("R" + Родитель.Верх + "C3").Значение = Число(Объект.ТабДок.Область("R" + Родитель.Верх + "C3").Значение) +  Число(Объект.ТабДок.Область("R" + Строка(НомСтр) + "C3").Значение);
			ОбщСумма = ОбщСумма +  Число(Объект.ТабДок.Область("R" + Строка(НомСтр) + "C3").Значение);
			Поиск =  Объект.ТабДок.Область("R" + Родитель.Верх + "C1").Расшифровка;
			РодительРодитель = Объект.ТабДок.НайтиТекст(Строка(Поиск),,,,Истина);
			
			Если РодительРодитель <> Неопределено И РодительРодитель.Текст <> "Сам" Тогда 
				Объект.ТабДок.Область("R" + РодительРодитель.Верх + "C3").Значение = Число(Объект.ТабДок.Область("R" + РодительРодитель.Верх + "C3").Значение) +  Число(Объект.ТабДок.Область("R" + Строка(НомСтр) + "C3").Значение);	
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	Объект.ТабДок.Область("R5C3").Значение	= ОбщСумма;
	Если КолвоКритериев <> 0 Тогда
		Объект.ТабДок.Область("R6C3").Значение	= Строка(Формат((ОбщСумма/КолвоКритериев)*100,"ЧДЦ=2"))+" %";
	Иначе 
		Объект.ТабДок.Область("R6C3").Значение	= Строка(Формат(0,"ЧДЦ=2"))+" %";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПересчетСуммРазделовДляЯчейки(НомСтр,Было,Стало)
	Поиск = Объект.ТабДок.Область("R" + Строка(НомСтр) + "C1").Расшифровка;
	Для НомС = 9 по Объект.ТабДок.ВысотаТаблицы - 1 цикл
		Если Объект.ТабДок.Область("R" + Строка(НомС) + "C2").Текст = Строка(Поиск) Тогда
			РодительСтр = НомС;
			Прервать;
		КонецЕсли;	
	КонецЦикла;
	Объект.ТабДок.Область("R" + РодительСтр + "C3").Значение = Число(Объект.ТабДок.Область("R" + РодительСтр + "C3").Значение) - Число(Было) + Число(Стало);
	Поиск =  Объект.ТабДок.Область("R" + РодительСтр + "C1").Расшифровка;
	РодительРодительСтр = Объект.ТабДок.НайтиТекст(Строка(Поиск),,,,Истина).Верх;
	Объект.ТабДок.Область("R" + РодительРодительСтр + "C3").Значение = Число(Объект.ТабДок.Область("R" + РодительРодительСтр + "C3").Значение) - Число(Было) + Число(Стало);
	Объект.ТабДок.Область("R5C3").Значение	= Число(Объект.ТабДок.Область("R5C3").Значение)- Число(Было) + Число(Стало);
	Если КолвоКритериев <> 0 Тогда
		Объект.ТабДок.Область("R6C3").Значение	= Строка(Формат((Объект.ТабДок.Область("R5C3").Значение/КолвоКритериев)*100,"ЧДЦ=2"))+" %";
	Иначе
		Объект.ТабДок.Область("R6C3").Значение	= Строка(Формат(0,"ЧДЦ=2"))+" %";
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	НачальноеЗаполнениеТабДок();
	Табл = РеквизитФормыВЗначение("Объект");
	Табл.ТабДок.НаправлениеПерехода = ТипНаправленияПереходаТабличногоДокумента.ПоСтрокам;
	ЗначениеВРеквизитФормы(Табл,"Объект");
	ПоказатьШапку = Истина;
	ПроверитьХранилище();
КонецПроцедуры

&НаСервере
Функция СохранитьВДокументНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ТабДок = ОбработкаОбъект.ТабДок;
	ВыбДокумент = ОбработкаОбъект.ВыбДокПроверки;
	
	
	Если не ЗначениеЗаполнено(ВыбДокумент) тогда
		//создаем
		ТекДокПроверки = Документы.РезультатыПроверкиМагазинаДАиК.СоздатьДокумент();
		
	иначе
		ТекДокПроверки = ВыбДокумент.ПолучитьОбъект();
		ТекДокПроверки.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		ТекДокПроверки.Результаты.Очистить();
	КонецЕсли;
	
	ТекДокПроверки.Автор = ПараметрыСеанса.ТекущийПользователь;
	
	ТекДокПроверки.Город = ОбработкаОбъект.Город;
	ТекДокПроверки.Подразделение = ОбработкаОбъект.Подразделение;
	ТекДокПроверки.Дата = ОбработкаОбъект.ДатаПроверки;
	Если ТекДокПроверки.Дата =НачалоДня(ТекущаяДата()) Тогда
		ТекДокПроверки.Дата = ТекущаяДата();
	КонецЕсли;
	ТекДокПроверки.Управляющий = ОбработкаОбъект.Управляющий;	
	ТекДокПроверки.РегионДиректор = ОбработкаОбъект.РД;
	ТекДокПроверки.НацДиректор = ОбработкаОбъект.НД;
	ТекДокПроверки.КолвоБаллов = ТабДок.Область("R5C3").Значение;
	ТекДокПроверки.ПроцентСоответствия = Лев(ТабДок.Область("R6C3").Значение,Найти(ТабДок.Область("R6C3").Значение,"%")-2);
	
	ТекДокПроверки.Записать(РежимЗаписиДокумента.Запись); //***
	
	Для НомСтр = 9 по ТабДок.ВысотаТаблицы цикл
		СсылкаНаЭлСпр = ТабДок.Область("R" + Строка(НомСтр) + "C2").Расшифровка;
		Если ЗначениеЗаполнено(СсылкаНаЭлСпр) тогда
			ПроверяемыйКритерий = ТабДок.Область("R" + Строка(НомСтр) + "C4").Значение;
			Если ПроверяемыйКритерий Тогда
				нов = ТекДокПроверки.Результаты.Добавить();
				нов.Критерий = СсылкаНаЭлСпр;
				Попытка
					нов.Кво = Число(ТабДок.Область("R" + Строка(НомСтр) + "C3").Текст);
				Исключение
					нов.Кво = 1;
				КонецПопытки;
						
				нов.КомментарииПроверяющего = ТабДок.Область("R" + Строка(НомСтр) + "C5").Текст;
				нов.СрокУстранения = ТабДок.Область("R" + Строка(НомСтр) + "C6").Значение;
		    КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	
	Попытка
		ТекДокПроверки.Записать(РежимЗаписиДокумента.Проведение);
		ОчиститьХранилище();
	Исключение
		Сообщить("Документ не проведен по причине " + ОписаниеОшибки());
	КонецПопытки;
	
	Возврат ТекДокПроверки.Ссылка; //*** 
	
КонецФункции

&НаКлиенте
Процедура СохранитьВДокумент(Команда)
	
КонецПроцедуры

&НаКлиенте
Функция СохранитьНаКлиенте()
	    //*** 
	Таб = Объект.ТабДок;
	Если  Строка(Объект.Город)  = "" Тогда
		 ПоказатьОповещениеПользователя("Документ не сохранен",, "Не заполнено поле ""Город""",БиблиотекаКартинок.Информация32);
		 Возврат Ложь;
	КонецЕсли;
	Если  Строка(Объект.Подразделение)  = "" Тогда
		 ПоказатьОповещениеПользователя("Документ не сохранен",, "Не заполнено поле ""ProStor №""",БиблиотекаКартинок.Информация32);
		 Возврат Ложь;
	КонецЕсли; 
	Если  Строка(Объект.Управляющий)  = "" Тогда
		 ПоказатьОповещениеПользователя("Документ не сохранен",, "Не заполнено поле ""Управляющий""",БиблиотекаКартинок.Информация32);
		 Возврат Ложь;
	КонецЕсли;
	 
	Если  Строка(Объект.РД)  = "" Тогда
		 ПоказатьОповещениеПользователя("Документ не сохранен",, "Не заполнено поле ""Региональный директор""",БиблиотекаКартинок.Информация32);
		 Возврат Ложь;
	КонецЕсли;
	 
	Если  Строка(Объект.НД)  = "" Тогда
		 ПоказатьОповещениеПользователя("Документ не сохранен",, "Не заполнено поле ""Национальный директор""",БиблиотекаКартинок.Информация32);
		 Возврат Ложь;
	КонецЕсли;
	 
	Для НомСтр = 9 по Таб.ВысотаТаблицы цикл
		СсылкаНаЭлСпр = Таб.Область("R" + Строка(НомСтр) + "C2").Расшифровка;
		Если ЗначениеЗаполнено(СсылкаНаЭлСпр) тогда
			ПроверяемыйКритерий = Таб.Область("R" + Строка(НомСтр) + "C4").Значение;
			Если ПроверяемыйКритерий Тогда
				Если Таб.Область("R" + Строка(НомСтр) + "C3").Значение <> 1 Тогда
					ТекстСообщения="";
					Если Таб.Область("R" + Строка(НомСтр) + "C6").Значение = Дата(1,1,1) Тогда
						ТекстСообщения="В строке "+ Таб.Область("R" + Строка(НомСтр) + "C1").Значение + " не указана дата устранения."+Символы.ПС+ "Документ не сохранен";
					КонецЕсли;
				
					Если Таб.Область("R" + Строка(НомСтр) + "C5").Значение = "" Тогда
						ТекстСообщения="В строке "+ Таб.Область("R" + Строка(НомСтр) + "C1").Значение + " не указана задача по устранению."+Символы.ПС+ "Документ не сохранен";
					КонецЕсли;
				
					Если ТекстСообщения<>"" Тогда
						Сообщить(ТекстСообщения);
						Возврат Ложь;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
    Док = СохранитьВДокументНаСервере();
	Объект.ВыбДокПроверки = Док; //***	
	//ВыбДокПроверкиПриИзмененииНаСервере(); //***
	//ПересчетСуммРазделов(Истина);
	Возврат Истина;

КонецФункции

&НаСервере
Процедура ВыбДокПроверкиПриИзмененииНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ТабДок = ОбработкаОбъект.ТабДок;
	
	ТабДок.Очистить();
	
	ВыбДокумент = ОбработкаОбъект.ВыбДокПроверки;
	
	Если не ЗначениеЗаполнено(ВыбДокумент) тогда
		НачальноеЗаполнениеТабДок();
		Возврат;
	КонецЕсли;
		
	ОбработкаОбъект.ДатаПроверки = ВыбДокумент.Дата;
	ОбработкаОбъект.Подразделение = ВыбДокумент.Подразделение;	      		
	ОбработкаОбъект.Город = ВыбДокумент.Город;			
	ОбработкаОбъект.Управляющий = ВыбДокумент.Управляющий;			
	ОбработкаОбъект.РД = ВыбДокумент.РегионДиректор;			
	ОбработкаОбъект.НД = ВыбДокумент.НацДиректор;
	
	Макет1 = РеквизитФормыВЗначение("Объект").ПолучитьМакет("Макет1");
	
	Обл = Макет1.ПолучитьОбласть("Шапка");			
	
	ТабДок.Вывести(Обл);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВложенныйЗапрос.Ссылка,
	               |	ВложенныйЗапрос.Родитель,
	               |	ВложенныйЗапрос.ЭтоГруппа,
	               |	ВложенныйЗапрос.ПолнНаименование,
	               |	ВЫБОР
	               |		КОГДА ВложенныйЗапрос.НомерПоПорядку > 1000
	               |			ТОГДА ВложенныйЗапрос.НомерПоПорядку
	               |		ИНАЧЕ ВложенныйЗапрос.РодительРодительНомерПоПорядку * 100000 + ВложенныйЗапрос.РодительНомерПоПорядку * 1000 + ВложенныйЗапрос.НомерПоПорядку
	               |	КОНЕЦ КАК ОбщийНомерПоПорядку,
	               |	ВложенныйЗапрос.НомерПоПорядку,
	               |	ВложенныйЗапрос.РодительНомерПоПорядку,
	               |	ВложенныйЗапрос.РодительРодительНомерПоПорядку,
	               |	СУММА(ВложенныйЗапрос.Кво) КАК Кво,
	               |	МАКСИМУМ(ВложенныйЗапрос.КомментарииПроверяющего) КАК КомментарииПроверяющего,
	               |	МАКСИМУМ(ВложенныйЗапрос.СрокУстранения) КАК СрокУстранения,
	               |	МАКСИМУМ(ВложенныйЗапрос.ОтметкаОбИсполнении) КАК ОтметкаОбИсполнении,
				   |	МАКСИМУМ(ВложенныйЗапрос.КомментарийИсполнителя) КАК КомментарийИсполнителя,
	               |	МАКСИМУМ(ВложенныйЗапрос.ЗадачаУправляющемуСсылка) КАК ЗадачаУправляющемуСсылка
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		КритерииПроверкиМагазинов.Ссылка КАК Ссылка,
	               |		КритерииПроверкиМагазинов.Родитель КАК Родитель,
	               |		КритерииПроверкиМагазинов.ЭтоГруппа КАК ЭтоГруппа,
	               |		КритерииПроверкиМагазинов.ПолнНаименование КАК ПолнНаименование,
	               |		ВЫБОР
	               |			КОГДА НЕ КритерииПроверкиМагазинов.ЭтоГруппа
	               |				ТОГДА КритерииПроверкиМагазинов.НомерПоПорядку
	               |			ИНАЧЕ ВЫБОР
	               |					КОГДА КритерииПроверкиМагазинов.Родитель.Ссылка ЕСТЬ NULL 
	               |						ТОГДА 100000 * КритерииПроверкиМагазинов.НомерПоПорядку
	               |					ИНАЧЕ 100000 * КритерииПроверкиМагазинов.Родитель.НомерПоПорядку + 1000 * КритерииПроверкиМагазинов.НомерПоПорядку
	               |				КОНЕЦ
	               |		КОНЕЦ КАК НомерПоПорядку,
	               |		ВЫБОР
	               |			КОГДА КритерииПроверкиМагазинов.Родитель.Ссылка ЕСТЬ NULL 
	               |				ТОГДА 0
	               |			ИНАЧЕ КритерииПроверкиМагазинов.Родитель.НомерПоПорядку
	               |		КОНЕЦ КАК РодительНомерПоПорядку,
	               |		ВЫБОР
	               |			КОГДА КритерииПроверкиМагазинов.Родитель.Родитель.Ссылка ЕСТЬ NULL 
	               |				ТОГДА 0
	               |			ИНАЧЕ КритерииПроверкиМагазинов.Родитель.Родитель.НомерПоПорядку
	               |		КОНЕЦ КАК РодительРодительНомерПоПорядку,
	               |		0 КАК Кво,
	               |		"""" КАК КомментарииПроверяющего,
	               |		&ПустДата КАК СрокУстранения,
	               |		ЛОЖЬ КАК ОтметкаОбИсполнении,
				   |		"""" КАК КомментарийИсполнителя,
	               |		0 КАК ЗадачаУправляющемуСсылка
	               |	ИЗ
	               |		Справочник.КритерииПроверкиМагазиновДАиК КАК КритерииПроверкиМагазинов
	               |	ГДЕ
	               |		НЕ КритерииПроверкиМагазинов.ПометкаУдаления
	               |	
	               |	ОБЪЕДИНИТЬ
	               |	
	               |	ВЫБРАТЬ
	               |		РезультатыПроверкиМагазинаРезультаты.Критерий,
	               |		РезультатыПроверкиМагазинаРезультаты.Критерий.Родитель,
	               |		РезультатыПроверкиМагазинаРезультаты.Критерий.ЭтоГруппа,
	               |		РезультатыПроверкиМагазинаРезультаты.Критерий.ПолнНаименование,
	               |		РезультатыПроверкиМагазинаРезультаты.Критерий.НомерПоПорядку,
	               |		ВЫБОР
	               |			КОГДА РезультатыПроверкиМагазинаРезультаты.Критерий.Родитель.Ссылка ЕСТЬ NULL 
	               |				ТОГДА 0
	               |			ИНАЧЕ РезультатыПроверкиМагазинаРезультаты.Критерий.Родитель.НомерПоПорядку
	               |		КОНЕЦ,
	               |		ВЫБОР
	               |			КОГДА РезультатыПроверкиМагазинаРезультаты.Критерий.Родитель.Родитель.Ссылка ЕСТЬ NULL 
	               |				ТОГДА 0
	               |			ИНАЧЕ РезультатыПроверкиМагазинаРезультаты.Критерий.Родитель.Родитель.НомерПоПорядку
	               |		КОНЕЦ,
	               |		РезультатыПроверкиМагазинаРезультаты.Кво,
	               |		РезультатыПроверкиМагазинаРезультаты.КомментарииПроверяющего,
	               |		РезультатыПроверкиМагазинаРезультаты.СрокУстранения,
	               |		РезультатыПроверкиМагазинаРезультаты.ОтметкаОбИсполнении,
				   |		РезультатыПроверкиМагазинаРезультаты.КомментарийИсполнителя,
	               |		ВЫБОР
	               |			КОГДА РезультатыПроверкиМагазинаРезультаты.ЗадачаУправляющему ЕСТЬ NULL 
	               |				ТОГДА 0
	               |			ИНАЧЕ РезультатыПроверкиМагазинаРезультаты.ЗадачаУправляющему
	               |		КОНЕЦ
	               |	ИЗ
	               |		Документ.РезультатыПроверкиМагазинаДАиК.Результаты КАК РезультатыПроверкиМагазинаРезультаты
	               |	ГДЕ
	               |		РезультатыПроверкиМагазинаРезультаты.Ссылка = &ВыбДокумент) КАК ВложенныйЗапрос
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВложенныйЗапрос.Ссылка,
	               |	ВложенныйЗапрос.Родитель,
	               |	ВложенныйЗапрос.ЭтоГруппа,
	               |	ВложенныйЗапрос.ПолнНаименование,
	               |	ВложенныйЗапрос.НомерПоПорядку,
	               |	ВложенныйЗапрос.РодительНомерПоПорядку,
	               |	ВложенныйЗапрос.РодительРодительНомерПоПорядку
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ОбщийНомерПоПорядку";
				   
				   
	Запрос.УстановитьПараметр("ВыбДокумент", ВыбДокумент);
	Запрос.УстановитьПараметр("ПустДата", Дата(2010,1,1));

	
	тз = Запрос.Выполнить().Выгрузить();
	//тз.Сортировать("РодительРодительНомерПоПорядку, РодительНомерПоПорядку, НомерПоПорядку");
	
	Нпп = 0;
	КолвоКритериев = 0;
	Для Каждого стр из тз цикл
		Если стр.ЭтоГруппа тогда
			Если ЗначениеЗаполнено(стр.Родитель) тогда  // подгруппа
				Обл = Макет1.ПолучитьОбласть("Группа");
				Обл.Параметры.СтрГруппа = стр.ПолнНаименование;
				Обл.Параметры.Родитель = стр.Родитель;
				Обл.Параметры.БалГруппа = 0;
				ТабДок.Вывести(Обл);

			иначе  // раздел
				Обл = Макет1.ПолучитьОбласть("Раздел");
				Обл.Параметры.СтрРаздел = стр.ПолнНаименование;
				Обл.Параметры.Родитель = "Сам";
				Обл.Параметры.БалРаздел = 0;
				ТабДок.Вывести(Обл);

			КонецЕсли;
			
		иначе // строка
			
			Нпп = Нпп + 1;
			Обл = Макет1.ПолучитьОбласть("Строка");
			Обл.Параметры.Нпп = Нпп;
			Обл.Параметры.СтрНаим = стр.ПолнНаименование;
			Обл.Параметры.ТекКритерий = стр.Ссылка;
			Обл.Параметры.СтрБал = стр.Кво;		
			Обл.Параметры.СтрКоммент = стр.КомментарииПроверяющего;	
			Обл.Параметры.Родитель = стр.Родитель;
			
			Если стр.Кво = 1 ИЛИ (стр.Кво = 0 И стр.КомментарииПроверяющего <> "") Тогда
				Обл.Параметры.Исп = Истина;
				КолвоКритериев = КолвоКритериев + 1;
			КонецЕсли;
			
			Если стр.СрокУстранения <> Дата(2010,1,1) тогда
				Обл.Параметры.СтрДат = стр.СрокУстранения;
			КонецЕсли;
			ТабДок.Вывести(Обл);
			Если ТабДок.Область("R"+ТабДок.ВысотаТаблицы+"C4").Значение Тогда
				ТабДок.Область("R"+ТабДок.ВысотаТаблицы+"C3").Формат = "ЧН=0";
				ТабДок.Область("R"+ТабДок.ВысотаТаблицы+"C3").Защита = Ложь;
				ТабДок.Область("R"+ТабДок.ВысотаТаблицы+"C5").Защита = Ложь;
				ТабДок.Область("R"+ТабДок.ВысотаТаблицы+"C6").Защита = Ложь;
			КонецЕсли;
		КонецЕсли;

	КонецЦикла;
	
	ТабДок.ФиксацияСверху = 8;
	ОблПусто = Макет1.ПолучитьОбласть("Пусто");
	ТабДок.Вывести(ОблПусто);
    ПроверкаПравРедактирования();
	ЗначениеВРеквизитФормы(ОбработкаОбъект,"Объект");
КонецПроцедуры

&НаКлиенте
Процедура ВыбДокПроверкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ЗначениеОтбора = Новый Структура("Автор", ПользователиКлиентСервер.ТекущийПользователь());
	ПараметрыВыбора = Новый Структура("Отбор", ЗначениеОтбора);
	ОткрытьФорму("Документ.РезультатыПроверкиМагазинаДАиК.ФормаВыбора",ПараметрыВыбора,,,,, Новый ОписаниеОповещения("ВыбДокПроверкиНачалоВыбораЗавершение", ЭтотОбъект));
КонецПроцедуры

&НаКлиенте
Процедура ВыбДокПроверкиНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	Если Результат <> Неопределено Тогда	
		Объект.ВыбДокПроверки = Результат;
		ВыбДокПроверкиПриИзмененииНаСервере();
		ПересчетСуммРазделов();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблДокПриИзменении(Элемент)
	ПоместитьВХранилище(Элемент.ТекущаяОбласть.Низ);
	Если Элемент.ТекущаяОбласть.Лево = 3 Тогда
		Элемент.ТекущаяОбласть.Значение = Число(Булево(Элемент.ТекущаяОбласть.Значение));
		Элемент.ТекущаяОбласть.Формат = "ЧН=0";
		ПересчетСуммРазделовДляЯчейки(Элемент.ТекущаяОбласть.Верх,МеняемоеЗначение,Элемент.ТекущаяОбласть.Значение);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблДокВыбор(Элемент, Область, СтандартнаяОбработка)	
	Если Элемент.ТекущаяОбласть.Лево = 4 Тогда
		СсылкаНаЭлСпр = Объект.ТабДок.Область("R" + Элемент.ТекущаяОбласть.Верх + "C2").Расшифровка;
		Если ЗначениеЗаполнено(СсылкаНаЭлСпр) Тогда
			Элемент.ТекущаяОбласть.Значение = НЕ Элемент.ТекущаяОбласть.Значение;
			ПересчетСуммРазделовДляЯчейки(Элемент.ТекущаяОбласть.Верх,Объект.ТабДок.Область("R" + Элемент.ТекущаяОбласть.Верх + "C3").Значение,0);
			Если Элемент.ТекущаяОбласть.Значение Тогда
				Объект.ТабДок.Область("R" + Элемент.ТекущаяОбласть.Верх + "C3").Защита = Ложь;
				Объект.ТабДок.Область("R" + Элемент.ТекущаяОбласть.Верх + "C5").Защита = Ложь;
				Объект.ТабДок.Область("R" + Элемент.ТекущаяОбласть.Верх + "C6").Защита = Ложь;
				КолвоКритериев = КолвоКритериев + 1;
			Иначе
				Объект.ТабДок.Область("R" + Элемент.ТекущаяОбласть.Верх + "C3").Значение = "";
				Объект.ТабДок.Область("R" + Элемент.ТекущаяОбласть.Верх + "C3").Формат = "ЧН="" """;
				Объект.ТабДок.Область("R" + Элемент.ТекущаяОбласть.Верх + "C3").Защита = Истина;
				Объект.ТабДок.Область("R" + Элемент.ТекущаяОбласть.Верх + "C5").Значение = "";
				Объект.ТабДок.Область("R" + Элемент.ТекущаяОбласть.Верх + "C5").Защита = Истина;
				Объект.ТабДок.Область("R" + Элемент.ТекущаяОбласть.Верх + "C6").Значение = "";
				Объект.ТабДок.Область("R" + Элемент.ТекущаяОбласть.Верх + "C6").Защита = Истина;
				КолвоКритериев = КолвоКритериев - 1;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Если Элемент.ТекущаяОбласть.Лево = 3 Тогда
		МеняемоеЗначение = Элемент.ТекущаяОбласть.Значение;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьШапкуПриИзменении(Элемент)
	Элементы.ВыбДокПроверки.Видимость = ПоказатьШапку;
	Элементы.ШапкаДокумента.Видимость = ПоказатьШапку;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	Если НЕ Закрывать Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект),"Все несохраненные данные будут удалены, сохранить документ?",РежимДиалогаВопрос.ДаНет,,,"ВНИМАНИЕ");
		Отказ = Истина;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Если СохранитьНаКлиенте() Тогда
			Закрывать = Истина;
			ЭтаФорма.Закрыть();
		КонецЕсли;
	Иначе
		Закрывать = Истина;
		ЭтаФорма.Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Закрывать = Ложь;
	Если ЕстьДанныеВХранилище Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ПриОткрытииЗавершение", ЭтотОбъект), "Есть данные заполненные раннее. Восстановить их?   В случае отказа данные будут удалены",РежимДиалогаВопрос.ДаНет,,,"Внимание!!!");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ВосстановитьИзХранилища();
		ПересчетСуммРазделов();
	Иначе
		ОчиститьХранилище();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ГородПриИзменении(Элемент)
	ГородПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ГородПриИзмененииНаСервере()
	Если ЗначениеЗаполнено(Объект.Город) Тогда
		ХранилищеНастроекДанныхФорм.Сохранить("Даик","Город",Объект.Город);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УправляющийПриИзменении(Элемент)
	УправляющийПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура УправляющийПриИзмененииНаСервере()
	Если ЗначениеЗаполнено(Объект.Управляющий) Тогда
		ХранилищеНастроекДанныхФорм.Сохранить("Даик","Управляющий",Объект.Управляющий);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	ПодразделениеПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПодразделениеПриИзмененииНаСервере()
	Если ЗначениеЗаполнено(Объект.Подразделение) Тогда
		ХранилищеНастроекДанныхФорм.Сохранить("Даик","Подразделение",Объект.Подразделение);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РДПриИзменении(Элемент)
	РДПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура РДПриИзмененииНаСервере()
	Если ЗначениеЗаполнено(Объект.РД) Тогда
		ХранилищеНастроекДанныхФорм.Сохранить("Даик","РД",Объект.РД);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НДПриИзменении(Элемент)
	НДПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура НДПриИзмененииНаСервере()
	Если ЗначениеЗаполнено(Объект.НД) Тогда
		ХранилищеНастроекДанныхФорм.Сохранить("Даик","НД",Объект.НД);
	КонецЕсли;
КонецПроцедуры
